Revit 2027 API
ParameterTypeId.LayerElemIsStructuralMaterial Property
 "Is Structural Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LayerElemIsStructuralMaterial { get; }
Public Shared ReadOnly Property LayerElemIsStructuralMaterial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LayerElemIsStructuralMaterial {
	ForgeTypeId^ get ();
}
static member LayerElemIsStructuralMaterial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace